 IDENTIFICATION DIVISION.
 PROGRAM-ID. CONDITION-NAME.
 ENVIRONMENT DIVISION.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 GENDER 	PIC X.
 	88 FEMALE VALUE "F" "f".
 	88 MALE VALUE "M" "m".
 
 PROCEDURE DIVISION.
 MAIN-ROUTINE.
 		 DISPLAY "ENTER GENDER :"
  ACCEPT GENDER.
  IF FEMALE
  	   	DISPLAY  "YOU ARE FEMALE"
  ELSE IF MALE
  		DISPLAY "YOU ARE MALE"
  ELSE
  		DISPLAY "UNDEFINED GENDER"
  STOP RUN.
